# Imports

In [5]:
import numpy as np
import matplotlib
import matplotlib.pyplot as plt
import pandas as pd

In [6]:
def showit(x):
    print(type(x))
    print()
    print(x)

## Read in the data

In [8]:
df = pd.read_csv("sample.csv")

In [9]:
df.sample(frac=.0001, random_state=42)

         size  age  team    win        date      prob      grade
33553  medium   70   red  False  2023-12-03  0.507487  79.609314
9427      big   26  blue  False  2023-10-23  0.505165  69.569005
199     small   50   red   True  2023-08-23  0.847352  88.857845
12447     big   62   red   True  2023-12-02  0.530678  90.695167
39489  medium   39  blue  False  2023-11-23  0.518361  80.950326

In [10]:
df.columns

Index(['size', 'age', 'team', 'win', 'date', 'prob', 'grade'], dtype='object')

In [15]:
df.index

RangeIndex(start=0, stop=50000, step=1)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   size    50000 non-null  object
 1   age     50000 non-null  int64
 2   team    50000 non-null  object
 3   win     50000 non-null  bool
 4   date    50000 non-null  object
 5   prob    50000 non-null  float64
 6   grade   50000 non-null  float64
dtypes: bool(1), float64(2), int64(1), object(3)
memory usage: 2.3+ MB

In [20]:
df.describe()

               age          prob         grade
count  50000.00000  50000.000000  50000.000000
mean      50.97078      0.466941     82.408342
std       19.32833      0.289434      7.452343
min       18.00000      0.000000     51.414152
25%       34.00000      0.215220     77.383642
50%       51.00000      0.467223     82.391035
75%       68.00000      0.714926     87.382418
max       84.00000      1.000000    113.617684

In [21]:
df[['team']].describe()

         team
count   50000
unique      4
top     green
freq    12583

In [22]:
df.shape

(50000, 7)